---
kind: property
id: P:Autodesk.Revit.DB.Mesh.MaterialElementId
source: html/284bb1fe-561d-a534-16ef-cf371e4da848.htm
---
# Autodesk.Revit.DB.Mesh.MaterialElementId Property

Element ID of the material from which this mesh is composed.

## Syntax (C#)
```csharp
public ElementId MaterialElementId { get; }
```